# CybosPlus API 동작확인

In [1]:
from API.main import CybosPlus

# 초기화 (계좌 비밀번호 입력)

In [3]:
CybosPlus.initialize()

# 연결 확인 및 계좌번호 확인

In [4]:
CybosPlus.is_connected()

1

In [8]:
account_number = CybosPlus.get_account_number()

In [9]:
print(account_number)

(u'335255368',)

In [10]:
my_acc = account_number[0]

## 계좌의 잔고 확인

In [13]:
money = CybosPlus.get_account_balance(my_acc)

In [15]:
print "KRW {:,}".format(money)

KRW 49,943,300

## 돌돌이 추천한 주식 구매

* 에스티팜
* 알보젠코리아
* 메디아나

## 각 종목 코드 확인

In [22]:
stock1 = CybosPlus.get_stock_code(u"에스티팜")
stock2 = CybosPlus.get_stock_code(u"알보젠코리아")
stock3 = CybosPlus.get_stock_code(u"메디아나")

In [23]:
print(stock1, stock2, stock3)

(u'A237690', u'A002250', u'A041920')

## 가격확인

In [27]:
CybosPlus.get_10_latest_quotes(stock1)

       Date  Start    Min    Max  Close
9  20160817  52400  50200  52800  50800
8  20160818  51000  50000  51600  50500
7  20160819  50700  50700  54800  54700
6  20160822  55300  54900  57200  55600
5  20160823  56300  54500  57200  55300
4  20160824  54000  52100  54400  52100
3  20160825  53000  51800  54000  53800
2  20160826  53900  53000  54500  53500
1  20160829  53800  53000  54100  53300
0  20160830  53700  52900  53900  53400

In [28]:
CybosPlus.get_10_latest_quotes(stock2)

       Date  Start    Min    Max  Close
9  20160817  34700  33500  34950  34100
8  20160818  34900  33500  34900  33800
7  20160819  34200  33300  34250  33400
6  20160822  33450  32400  33450  32400
5  20160823  31850  31850  33400  33100
4  20160824  33000  32250  33300  32400
3  20160825  32300  31400  32550  32000
2  20160826  32450  31700  32700  32500
1  20160829  32500  31400  32650  31400
0  20160830  31600  31200  32000  31500

In [29]:
CybosPlus.get_10_latest_quotes(stock3)

       Date  Start    Min    Max  Close
9  20160817  20250  20100  21150  20300
8  20160818  20300  20000  20450  20250
7  20160819  20350  20050  20400  20150
6  20160822  20100  19700  20400  19800
5  20160823  19650  19450  20850  19950
4  20160824  20100  19800  20150  19950
3  20160825  20000  19250  20000  19300
2  20160826  19300  18950  22500  19750
1  20160829  19800  19000  20300  19100
0  20160830  19100  18450  19300  18550

In [ ]:
stock_prices = [53400, 31500, 18550]

## 얼마 사야 되지 계산좀
$$ 53400 * a + 31500 * b + 18550 * c = 49,943,300 $$

## 모르겠으니그냥 각 10주씩 구매

In [30]:
CybosPlus.buy_order(my_acc, stock1, 10)
CybosPlus.buy_order(my_acc, stock2, 10)

(u'2', 3547)

In [31]:
CybosPlus.buy_order(my_acc, stock3, 10)

(u'2', 3551)

In [39]:
portfolio = CybosPlus.get_account_portfolio(my_acc)

In [36]:
import pandas as pd

In [40]:
pd.DataFrame(portfolio, columns=['종목명', '결제수량', '체결수량', '평가금액', '수익률', '매도가능'])

      종목명  결제수량  체결수량     평가금액   수익률  매도가능
0  알보젠코리아     1     1    31000 -1.25     1
1   NAVER    10    10  8112000 -0.52    10
2    메디아나    10    10   185000 -1.02    10
3    에스티팜    10    10   530000 -0.71    10

## 알보젠코리아 주문은 10개였으나 시장가에 1건만 체결이 되었음

In [47]:
pd.DataFrame(CybosPlus.get_order_status(my_acc))

      0        1       2        3   4
0  3551  A041920    메디아나  정규장현금매수  10
1  3547  A002250  알보젠코리아  정규장현금매수   1
2  3545  A237690    에스티팜  정규장현금매수  10
3  3316  A035420   NAVER  정규장현금매수   2
4  3316  A035420   NAVER  정규장현금매수   8

## 구매 테스트 확인끝